grevaillot/svd_tools/headers/STM32H7x7_CM7/memorymap.h
#pragma once 

#define TIM2_BASE			(0x40000000)
#define TIM3_BASE			(0x40000400)
#define TIM4_BASE			(0x40000800)
#define TIM5_BASE			(0x40000c00)
#define TIM6_BASE			(0x40001000)
#define TIM7_BASE			(0x40001400)
#define TIM12_BASE			(0x40001800)
#define TIM13_BASE			(0x40001c00)
#define TIM14_BASE			(0x40002000)
#define LPTIM1_BASE			(0x40002400)
#define WWDG1_BASE			(0x40002c00)
#define SPI2_BASE			(0x40003800)
#define SPI3_BASE			(0x40003c00)
#define SPDIFRX_BASE			(0x40004000)
#define USART2_BASE			(0x40004400)
#define USART3_BASE			(0x40004800)
#define UART4_BASE			(0x40004c00)
#define UART5_BASE			(0x40005000)
#define I2C1_BASE			(0x40005400)
#define I2C2_BASE			(0x40005800)
#define I2C3_BASE			(0x40005c00)
#define CEC_BASE			(0x40006c00)
#define DAC_BASE			(0x40007400)
#define UART7_BASE			(0x40007800)
#define UART8_BASE			(0x40007c00)
#define CRS_BASE			(0x40008400)
#define SWPMI_BASE			(0x40008800)
#define OPAMP_BASE			(0x40009000)
#define MDIOS_BASE			(0x40009400)
#define FDCAN1_BASE			(0x4000a000)
#define FDCAN2_BASE			(0x4000a400)
#define CAN_CCU_BASE			(0x4000a800)
#define TIM1_BASE			(0x40010000)
#define TIM8_BASE			(0x40010400)
#define USART1_BASE			(0x40011000)
#define USART6_BASE			(0x40011400)
#define SPI1_BASE			(0x40013000)
#define SPI4_BASE			(0x40013400)
#define TIM15_BASE			(0x40014000)
#define TIM16_BASE			(0x40014400)
#define TIM17_BASE			(0x40014800)
#define SPI5_BASE			(0x40015000)
#define SAI1_BASE			(0x40015800)
#define SAI2_BASE			(0x40015c00)
#define SAI3_BASE			(0x40016000)
#define DFSDM_BASE			(0x40017000)
#define HRTIM_Master_BASE			(0x40017400)
#define HRTIM_TIMA_BASE			(0x40017480)
#define HRTIM_TIMB_BASE			(0x40017500)
#define HRTIM_TIMC_BASE			(0x40017580)
#define HRTIM_TIMD_BASE			(0x40017600)
#define HRTIM_TIME_BASE			(0x40017680)
#define HRTIM_Common_BASE			(0x40017780)
#define DMA1_BASE			(0x40020000)
#define DMA2_BASE			(0x40020400)
#define DMAMUX1_BASE			(0x40020800)
#define ADC1_2_BASE			(0x40022000)
#define ART_BASE			(0x40024400)
#define Ethernet_MAC_BASE			(0x40028000)
#define OTG_HS_GLOBAL_BASE			(0x40040000)
#define OTG_HS_HOST_BASE			(0x40040400)
#define OTG_HS_DEVICE_BASE			(0x40040800)
#define OTG_HS_PWRCLK_BASE			(0x40040e00)
#define OTG_FS_GLOBAL_BASE			(0x40080000)
#define OTG_FS_HOST_BASE			(0x40080400)
#define OTG_FS_DEVICE_BASE			(0x40080800)
#define OTG_FS_PWRCLK_BASE			(0x40080e00)
#define DCMI_BASE			(0x48020000)
#define CRYP_BASE			(0x48021000)
#define HASH_BASE			(0x48021400)
#define RNG_BASE			(0x48021800)
#define SDMMC2_BASE			(0x48022400)
#define RAMECC2_BASE			(0x48023000)
#define LTDC_BASE			(0x50001000)
#define WWDG2_BASE			(0x50003000)
#define MDMA_BASE			(0x52000000)
#define DMA2D_BASE			(0x52001000)
#define JPEG_BASE			(0x52003000)
#define FMC_BASE			(0x52004000)
#define QUADSPI_BASE			(0x52005000)
#define SDMMC1_BASE			(0x52007000)
#define RAMECC1_BASE			(0x52009000)
#define EXTI_BASE			(0x58000000)
#define SYSCFG_BASE			(0x58000400)
#define LPUART1_BASE			(0x58000c00)
#define SPI6_BASE			(0x58001400)
#define I2C4_BASE			(0x58001c00)
#define LPTIM2_BASE			(0x58002400)
#define LPTIM3_BASE			(0x58002800)
#define LPTIM4_BASE			(0x58002c00)
#define LPTIM5_BASE			(0x58003000)
#define COMP1_BASE			(0x58003800)
#define VREFBUF_BASE			(0x58003c00)
#define RTC_BASE			(0x58004000)
#define IWDG1_BASE			(0x58004800)
#define IWDG2_BASE			(0x58004c00)
#define SAI4_BASE			(0x58005400)
#define GPIOA_BASE			(0x58020000)
#define GPIOB_BASE			(0x58020400)
#define GPIOC_BASE			(0x58020800)
#define GPIOD_BASE			(0x58020c00)
#define GPIOE_BASE			(0x58021000)
#define GPIOF_BASE			(0x58021400)
#define GPIOG_BASE			(0x58021800)
#define GPIOH_BASE			(0x58021c00)
#define GPIOI_BASE			(0x58022000)
#define GPIOJ_BASE			(0x58022400)
#define GPIOK_BASE			(0x58022800)
#define RCC_BASE			(0x58024400)
#define PWR_BASE			(0x58024800)
#define CRC_BASE			(0x58024c00)
#define BDMA_BASE			(0x58025400)
#define DMAMUX2_BASE			(0x58025800)
#define ADC3_BASE			(0x58026000)
#define HSEM_BASE			(0x58026400)
#define RAMECC3_BASE			(0x58027000)
#define SCB_ACTRL_BASE			(0xe000e008)
#define STK_BASE			(0xe000e010)
#define NVIC_BASE			(0xe000e100)
#define SCB_BASE			(0xe000ed00)
#define FPU_CPACR_BASE			(0xe000ed88)
#define MPU_BASE			(0xe000ed90)
#define NVIC_STIR_BASE			(0xe000ef00)
